Kubelet یکی از اجزای کلان Kubernetes است و مسئول اجرای کانتینرها در نودهای کلاستر می‌باشد. Kubelet وظیفه اجرای کانتینرها را بر اساس دستوراتی که توسط مدیر کنترل (Control Manager) ارسال می‌شوند، بر عهده دارد. 

وظایف اصلی Kubelet عبارتند از:

**پذیرش دستورات اجرا:** Kubelet از Control Plane دستورات اجرای کانتینرها را دریافت می‌کند. این دستورات معمولاً توسط وسائلی مانند Deployment یا Pod ارسال می‌شوند.

**مانیتورینگ وضعیت پادها:** Kubelet مانیتورینگ وضعیت کانتینرها را در نود اجرا می‌کند و در صورت نیاز به Control Plane گزارش می‌دهد.

**مدیریت منابع:** Kubelet با مدیریت منابع (Resource Management) کانتینرها در نود مشغول است. این شامل مدیریت CPU و حافظه مصرفی توسط کانتینرها می‌شود.

**Network Configuration:** Kubelet نقشی در تنظیمات شبکه برای کانتینرها ایفا می‌کند.

**اجرای Probe‌ها:** Kubelet مسئول اجرای Probe‌ها (مثل Liveness Probe یا Readiness Probe) در کانتینرها است.

**مدیریت Logging و Event:** Kubelet وظیفه مدیریت لاگ‌ها و رخدادهای مربوط به اجرای کانتینرها را دارد.

**تعامل با Container Runtime:** Kubelet با رابط Container Runtime (مثل Docker یا containerd) برای اجرای و مدیریت کانتینرها تعامل دارد.

به طور کلی، Kubelet مسئول اجرای کانتینرها در نودها است و در تنظیمات و مانیتورینگ کانتینرها نقش اساسی دارد.
